docs/emacs-portable.org
#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head:
#+html_head_extra:
#+subtitle:
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)
#+latex_header:

#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:nil todo:t |:t
#+title: Running Emacs as a Portable Application
#+date: <2022-03-30 Wed>
#+author: Thomas Freeman
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.5.2)
#+cite_export:


* Depedencies

** Creating LaTeX Documents
MiKTeX provides a [[https://miktex.org/howto/portable-edition][portable version]] that can be installed on a flash drive and will make it possible to create LaTeX documents even if LaTeX libraries are not insalled on the host system. 

** Git
If you have the PortableApps.com platform installed on your flash drive. You can install [[https://github.com/sheabunge/GitPortable/releases][GitPortable]] and telling Emacs where the ~git~ executable can be found.

#+begin_src emacs-lisp
  (add-to-list 'exec-path "~/PortableApps/GitPortable/App/Git/bin"))
#+end_src

** Spell Checking
Spell checking does not work by default in Windows as ~ispell~ and ~aspell~ are not installed. To overcome this issue, a portable version of hunspell can be installed directly into the ~.emacs.d~ directory from [[https://sourceforge.net/projects/ezwinports/files/][ezwinports]] and set as the ~ispell-program-name~:

#+begin_src emacs-lisp
  (if (eq system-type 'windows-nt)
      (progn (setq ispell-program-name (expand-file-name "~/.emacs.d/hunspell/bin/hunspell.exe"))
             (setq ispell-personal-dictionary "~/.emacs.d/hunspell_en_US")
             (setq ispell-local-dictionary "en_US")
             (setq ispell-local-dictionary-alist
                   '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8))))
    (setq ispell-program-name (whicher "hunspell")))
#+end_src

** PlantUML

