docs/emacs-portable.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-31 Thu 00:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Running Emacs as a Portable Application</title>
<meta name="author" content="Thomas Freeman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Running Emacs as a Portable Application</h1>


<div id="outline-container-org7776d48" class="outline-2">
<h2 id="org7776d48"><span class="section-number-2">1.</span> Depedencies</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org69808b2" class="outline-3">
<h3 id="org69808b2"><span class="section-number-3">1.1.</span> Creating LaTeX Documents</h3>
<div class="outline-text-3" id="text-1-1">
<p>
MiKTeX provides a <a href="https://miktex.org/howto/portable-edition">portable version</a> that can be installed on a flash drive and will make it possible to create LaTeX documents even if LaTeX libraries are not insalled on the host system. 
</p>
</div>
</div>

<div id="outline-container-org9edfcde" class="outline-3">
<h3 id="org9edfcde"><span class="section-number-3">1.2.</span> Git</h3>
<div class="outline-text-3" id="text-1-2">
<p>
If you have the PortableApps.com platform installed on your flash drive. You can install <a href="https://github.com/sheabunge/GitPortable/releases">GitPortable</a> and telling Emacs where the <code>git</code> executable can be found.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>add-to-list 'exec-path <span style="color: #7984D1;">"~/PortableApps/GitPortable/App/Git/bin"</span><span style="color: #1ea8fc;">)</span><span style="color: #e61f44; font-weight: bold;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org89f601b" class="outline-3">
<h3 id="org89f601b"><span class="section-number-3">1.3.</span> Spell Checking</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Spell checking does not work by default in Windows as <code>ispell</code> and <code>aspell</code> are not installed. To overcome this issue, a portable version of hunspell can be installed directly into the <code>.emacs.d</code> directory from <a href="https://sourceforge.net/projects/ezwinports/files/">ezwinports</a> and set as the <code>ispell-program-name</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">if</span> <span style="color: #ff2afc;">(</span>eq system-type 'windows-nt<span style="color: #ff2afc;">)</span>
    <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">progn</span> <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> ispell-program-name <span style="color: #df85ff;">(</span>expand-file-name <span style="color: #7984D1;">"~/.emacs.d/hunspell/bin/hunspell.exe"</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span>
           <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> ispell-personal-dictionary <span style="color: #7984D1;">"~/.emacs.d/hunspell_en_US"</span><span style="color: #a7da1e;">)</span>
           <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> ispell-local-dictionary <span style="color: #7984D1;">"en_US"</span><span style="color: #a7da1e;">)</span>
           <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> ispell-local-dictionary-alist
                 '<span style="color: #df85ff;">(</span><span style="color: #A875FF;">(</span><span style="color: #7984D1;">"en_US"</span> <span style="color: #7984D1;">"[[:alpha:]]"</span> <span style="color: #7984D1;">"[</span><span style="color: #ff2afc; font-weight: bold;">^</span><span style="color: #7984D1;">[:alpha:]]"</span> <span style="color: #7984D1;">"[']"</span> nil <span style="color: #1ea8fc;">(</span><span style="color: #7984D1;">"-d"</span> <span style="color: #7984D1;">"en_US"</span><span style="color: #1ea8fc;">)</span> nil utf-8<span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> ispell-program-name <span style="color: #a7da1e;">(</span>whicher <span style="color: #7984D1;">"hunspell"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org87f8c41" class="outline-3">
<h3 id="org87f8c41"><span class="section-number-3">1.4.</span> PlantUML</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-03-30 Wed 00:00</p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-03-31 Thu 00:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
